[
  {
    "title": "NexoWorld",
    "slug": "nexoworld",
    "excerpt": "An innovative mobile game merging exploration, digital currency, and social interaction in real-world environments.",
    "overview": "NexoWorld is a groundbreaking mobile game that blends the real and digital worlds through augmented reality (AR). Drawing inspiration from games like Pokémon Go, it offers a unique twist—players explore real-world locations to collect, trade, and manage in-app currency while participating in challenges and unlocking new content. The game integrates spatial data and microservices architecture to provide seamless real-time updates and ensure high performance on both Android and iOS platforms.\n\nNexoWorld's fusion of digital assets with physical exploration introduces a new dimension of gaming, offering players personalized experiences, in-game quests, and trading opportunities. The project utilizes DevOps practices for cloud-native deployment, ensuring high availability and scalability.",
    "image": "/projects/nexoworld.png",
    "category": "Mobile Game",
    "timeline": {
      "start": "Oct 2024",
      "end": "Present"
    },
    "featured": true,
    "technologies": ["Spring Boot", "Node.js", "Flutter", "PosGis", "MongoDB", "Redis", "Docker", "Kubernetes", "Kafka"],
    "features": [
      "Real-Time Location-Based Gameplay: Players explore real-world locations to unlock content, complete quests, and collect digital assets.",
      "In-App Currency System: Players earn, trade, and manage currency through challenges and transactions, adding a gamified economic layer.",
      "Microservices Architecture: Ensures scalability, modularity, and high performance, allowing different services to operate independently.",
      "Push Notifications & Personalized Offers: Sends notifications based on player activity, encouraging continued engagement with exclusive offers and events.",
      "Cross-Platform Compatibility: Developed using Flutter, providing smooth performance on both Android and iOS platforms.",
      "High Availability & Messaging: Redis caching for real-time performance optimization and Kafka for reliable messaging between services.",
      "Cloud-Native Deployment: Uses Docker and Kubernetes for efficient and scalable deployment in cloud environments."
    ],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      },
      {
        "name": "Abdelmajid ZADDI",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/abdelmajid-zaddi-694b2b290/",
        "github": "https://www.github.com/LHW001abc"
      },
      {
        "name": "Loukmane ADHAIM",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/loukmanead404/",
        "github": "https://www.github.com/LokmanAdh"
      },
      {
        "name": "Abdelaziz AFRIAD",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/afriad-abdelaziz/",
        "github": "https://www.github.com/afrivd"
      }
    ],
    "tags": ["Microservices", "DevOps", "Game", "Mobile App", "Spatial Data", "AR", "Currency", "Exploration"],
    "github": "https://github.com/NexoWorld"
  },
  {
    "title": "Kolchi.ma",
    "slug": "kolchi.ma",
    "excerpt": "Your One-Stop Marketplace for Buying, Selling, and Repairing – All in One Seamless Experience",
    "overview": "kolchi.ma is an advanced online marketplace designed for the buying and selling of new and used products with a unique repair services integration. Our platform enables users to discover great deals, manage their products, request repairs, and enjoy a personalized experience all in one place. Built with a scalable, microservices architecture, kolchi.ma ensures flexibility, security, and optimized performance to deliver an exceptional user experience.",
    "image": "/projects/kolchi.ma.png",
    "category": "Web Application",
    "timeline": {
      "start": "May 2024",
      "end": "Present"
    },
    "featured": true,
    "technologies": ["DotNet Core", "Spring Boot", "Node.js", "NestJs", "Angular", "JWT", "MongoDB", "PostgreSQL", "SQL Server", "Redis", "Docker", "Git Flow", "GitHub Actions"],
    "features": [
      "User Registration and Authentication: Secure sign-up and login for Admins, Sellers, and Clients, with social media integration, email verification, and password reset.",
      "Product Listings: Sellers can create, manage, and display new and used product listings, including bulk uploads.",
      "Order Management: Clients can place orders and track their status. Sellers can manage orders, update statuses, and handle cancellations/returns.",
      "Payment Integration: Secure payment processing through Stripe or PayPal, supporting multiple payment methods.",
      "Repair Service Requests: Clients can request repair services, schedule appointments, and track the status of their requests.",
      "Admin Dashboard: Admins can manage users, listings, and orders, view analytics, and handle support tickets.",
      "Reviews and Ratings: Clients can leave reviews and ratings for products and repair services, and Sellers can respond. Admins can moderate reviews.",
      "Messaging System: Integrated messaging for direct communication between Clients and Sellers, with real-time notifications.",
      "Promotions and Discounts: Sellers can create and manage promotions, such as discount codes and flash sales, displayed on the homepage.",
      "User Profiles and Personalization: Users can manage their profiles, receive personalized recommendations, and customize their experience."
    ],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      }
    ],
    "tags": ["E-commerce", "Services", "Web App", "Microservices"],
    "github": "https://github.com/kolchi-ma"
  },
  {
    "title": "Dr Maroc",
    "slug": "drmaroc",
    "excerpt": "Dr Maroc offers a broad range of digital solutions to help doctors manage their clinics, services, and patients, as well as to simplify appointment booking for patients. ",
    "overview": "Dr Maroc aims to modernize healthcare in Morocco by equipping medical professionals with digital tools and services to optimize clinic management. This web platform streamlines various healthcare operations, from appointment scheduling to patient record management, while enabling doctors to market their services. The platform ensures data security through industry-standard encryption techniques and offers a seamless user experience for both doctors and patients.",
    "image": "/projects/drmaroc.png",
    "category": "Web Application",
    "timeline": {
      "start": "Jul 2024",
      "end": "Present"
    },
    "featured": true,
    "technologies": ["Spring Boot", "React.js", "PostgreSQL", "JUnit", "JWT", "Docker", "Git Flow", "CI/CD", "VPS"],
    "features": [
      "Appointment Management: Easily manage patient appointments with an intuitive scheduling system.",
      "Doctor Profiles: Doctors can create and manage their profiles, list services, and availability.",
      "Patient Records: A solution for digitizing patient medical records while ensuring data security.",
      "Assistant Management: Doctors can add and manage assistants to help with daily tasks.",
      "Marketing Solutions: Doctors can promote their services directly through our platform.",
      "Clinic Digitalization: Tools to assist in the digital transformation of healthcare offices.",
      "Medical Equipment Setup: A service for installing and managing medical equipment in clinics."
    ],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      }
    ],
    "tags": ["Healthcare", "Clinic Management", "Appointment Booking", "Digital Solutions"],
    "production": "https://drmaroc.com"
  },
  {
    "title": "ZStore.Net",
    "slug": "zstore-net",
    "excerpt": "ZStore.Net is a modern e-commerce platform designed to streamline online retail operations, offering seamless product management and customer engagement features.",
    "overview": "Built with ASP.Net Core, ZStore.Net aims to provide a robust and scalable solution for online stores, ensuring smooth operations from product listings to order management. The platform leverages MVC architecture for a clean separation of concerns and Entity Framework to simplify database interactions with MS SQL. Through CI/CD pipelines, ZStore.Net supports continuous development and deployment for quick feature releases and bug fixes.",
    "image": "/projects/zstore.net.png",
    "category": "Web Application",
    "timeline": {
      "start": "Oct 2024",
      "end": "Present"
    },
    "features": [
      "Product Management: Easily manage product listings, categories, and inventory.",
      "Order Management: Track customer orders from placement to delivery.",
      "User Authentication: Secure login and registration processes with role-based access control."
    ],
    "featured": false,
    "technologies": ["ASP.Net Core", "MVC", "MS SQL", "Entity Framework", "Docker", "Git Flow", "CI/CD"],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      }
    ],
    "tags": ["E-commerce", "Web App", "ASP.Net Core", "MVC", "MS SQL"],
    "github": "https://github.com/ismailza/zstore.net"
  },
  {
    "title": "Busway Ticket Chatbot",
    "slug": "busway-ticket-chatbot",
    "excerpt": "Innovative web app for seamless busway ticket reservations, using Neo4j to manage complex data relationships.",
    "overview": "The Busway Ticket Chatbot is a cutting-edge web application developed as part of the Object Technology/IoT Workshop. It simplifies busway ticket reservations by leveraging a Neo4j graph database to efficiently manage complex data relationships, such as bus schedules, stations, and drivers. This project enhances the user experience by incorporating an AIML-powered chatbot, enabling a conversational interface for booking tickets and obtaining travel information.\n\nThe goal was to build a system that offers users a seamless, intuitive, and engaging booking experience while maintaining sophisticated backend data management. The chatbot interacts with users conversationally, transforming the traditional booking process into an easy, interactive journey.",
    "image": "/projects/busway-ticket-chatbot.png",
    "category": "Web Application",
    "timeline": {
      "start": "Feb 2024",
      "end": "Mar 2024"
    },
    "featured": true,
    "technologies": ["Spring Boot", "Thymeleaf", "Neo4j", "AIML", "Docker"],
    "features": [
      "Trip Visualization: Users can explore available trips with detailed route information, including departure and arrival times.",
      "Online Reservation System: Provides a hassle-free online ticket booking experience, available 24/7.",
      "Dynamic Data Management with Neo4j: The system utilizes Neo4j to manage relationships between buses, drivers, and stations, ensuring accurate data and real-time updates.",
      "User-Friendly Interface with Thymeleaf: Designed with simplicity and ease of use in mind, providing smooth navigation and interaction for users.",
      "AIML-Powered Chatbot: The chatbot offers a conversational interface, making ticket booking more engaging and personal."
    ],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      },
      {
        "name": "Oumaima OUASLI",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/oumaima-ouasli/",
        "github": "https://www.github.com/oumaima2002"
      }
    ],
    "tags": ["Spring Boot", "Thymeleaf", "Neo4j", "AIML"],
    "github": "https://github.com/ismailza/Busway-TicketChatBot"
  },
  {
    "title": "Centralization and Classification of New York City Traffic",
    "slug": "centralization-and-classification-of-new-york-city-traffic",
    "excerpt": "Web portal for analyzing and visualizing traffic centrality in NYC, developed during Object/IoT Technologies workshop.",
    "overview": "The Centralization and Classification of New York City Traffic is a web-based portal built as part of the Object/IoT Technologies workshop. This project offers dynamic traffic analysis by leveraging modern mapping tools and clustering algorithms to visualize traffic flows in New York City. Users can explore traffic data through interactive maps, filter it by time slots, and uncover critical insights about central traffic patterns.\n\nThe system makes use of AGNES clustering to classify traffic flows efficiently, along with Leaflet.js to visualize it through interactive maps. Its responsive design ensures accessibility across devices, delivering a seamless experience for global users with multi-language support.",
    "image": "/projects/traffic-centrality.png",
    "category": "Web Portal",
    "timeline": {
      "start": "Feb 2024",
      "end": "Mar 2024"
    },
    "featured": true,
    "technologies": ["React.js", "Leaflet", "React-Leaflet", "Bootstrap", "JSON", "Python", "AGNES", "Docker"],
    "features": [
      "Interactive Map Visualization: Users can zoom and pan through traffic maps for a detailed view of NYC traffic patterns.",
      "Advanced Data Filters: Filter traffic data by year, month, day, and time slots to explore trends across different timeframes.",
      "Color-Coded Clusters: Traffic clusters are visually represented using color codes to highlight areas of congestion or smooth traffic.",
      "Real-Time Traffic Flow Insights: Clickable map markers reveal detailed traffic information and central points.",
      "Responsive Design with Multi-Language Support: Designed to work efficiently on both desktop and mobile devices, with multi-language features for a global audience."
    ],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      },
      {
        "name": "Khaoula ABASSI",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/khaoula-abassi/",
        "github": "https://www.github.com/Wahya1"
      },
      {
        "name": "Mohamed JEBBANEMA",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/mohamed-jebbanema/",
        "github": "https://www.github.com/medjebb"
      },
      {
        "name": "El Mehdi Salah BEN SOUDA",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/el-mehdi-salah-ben-souda/",
        "github": "https://www.github.com/Mehdi-Ben-Souda"
      }
    ],
    "tags": ["React.js", "Leaflet", "AGNES"],
    "github": "https://github.com/ismailza/Traffic-Centrality"
  },
  {
    "title": "ZStore.JEE",
    "slug": "zstore-jee",
    "excerpt": "Dynamic ecommerce web app with JEE, MVC, Hibernate, and MySQL for seamless online shopping experiences.",
    "overview": "ZStore is a feature-rich ecommerce web application designed with JEE technologies following the MVC architecture. It offers users a smooth shopping experience with an intuitive interface and dynamic product catalog. On the backend, Hibernate ORM efficiently manages the persistence layer, while MySQL ensures secure handling of product and user data.\n\nThis project also includes a backend administration panel for managing products, orders, and user accounts. As a key developer, I led the integration of Hibernate and contributed to the frontend development using JSP to enhance site responsiveness and user interaction.",
    "image": "/projects/zstore.jee.png",
    "category": "Web Application",
    "timeline": {
      "start": "Mar 2024",
      "end": "Mar 2024"
    },
    "features": [
      "User-Friendly Interface: Simple navigation for efficient product search.",
      "Dynamic Product Catalog: Includes detailed descriptions and product images.",
      "Shopping Cart Functionality: Users can add, remove, and manage products before checkout.",
      "Admin Panel: Manage products, orders, and user accounts through a secure backend."
    ],
    "featured": true,
    "technologies": ["Jakarta EE", "JSP", "MVC", "Hibernate", "MySQL"],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      }
    ],
    "tags": ["JEE", "JSP", "MVC", "Hibernate", "MySQL"],
    "github": "https://github.com/ismailza/ZStore"
  },
  {
    "title": "Sudoku",
    "slug": "sudoku",
    "excerpt": "Desktop game developed using a backtracking algorithm to generate and solve Sudoku puzzles.",
    "overview": "The game is developed using a backtracking algorithm to generate and solve the Sudoku puzzles. The algorithm works by filling in the grid with numbers from 1 to the grid size (9 for a standard 9x9 Sudoku grid) aleatorily. If the number is valid, it moves on to the next cell. If the number is not valid, it tries the next number. If no number is valid, it backtracks to the previous cell and tries a different number. This process is repeated until the grid is filled.",
    "image": "/projects/sudoku.png",
    "category": "Desktop Game",
    "timeline": {
      "start": "Jan 2024",
      "end": "Jan 2024"
    },
    "featured": true,
    "technologies": ["C++", "SFML"],
    "features": [
      "Classic Sudoku Gameplay: Intuitive user interface for easy navigation.",
      "Multiple Difficulty Levels: Suitable for both casual and advanced players.",
      "Immersive Audio Effects: Enhanced with sound for a richer experience."
    ],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      }
    ],
    "tags": ["cpp", "sfml", "game"],
    "github": "https://github.com/ismailza/Sudoku",
    "release": "https://github.com/ismailza/Sudoku/releases/latest"
  },
  {
    "title": "JI2A . Payroll Management Platform",
    "slug": "ji2a-payroll-management-platform",
    "excerpt": "Full-stack web app for managing organizational payroll processes with PHP, Bootstrap and MySQL.",
    "overview": "Developed full-stack web applications for managing payroll processes within an organization.",
    "image": "/projects/ji2a.png",
    "category": "Web Application",
    "timeline": {
      "start": "May 2023",
      "end": "Jun 2023"
    },
    "featured": true,
    "features": [
      "User authentication and authorization for secure access.",
      "Employee management with detailed profiles and salary information.",
      "Payroll processing with automated calculations and tax deductions."
    ],
    "technologies": ["PHP", "Bootstrap", "Ajax", "MySQL"],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      },
      {
        "name": "JalalEddine OUTGOUGA",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/jeout/",
        "github": "https://www.github.com/JeddineO"
      },
      {
        "name": "Abdelmajid ZADDI",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/abdelmajid-zaddi-694b2b290/",
        "github": "https://www.github.com/LHW001abc"
      },
      {
        "name": "Abdelaziz AFRIAD",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/afriad-abdelaziz/",
        "github": "https://www.github.com/afrivd"
      }
    ],
    "tags": ["PHP", "Bootstrap", "Ajax", "MySQL"],
    "github": "https://github.com/ismailza/Gestion_Paie"
  },
  {
    "title": "Checkers Game",
    "slug": "checkers-game",
    "excerpt": "Desktop Checkers game developed with C and GTK+ for a rich graphical user experience.",
    "overview": "Developed desktop game \"Checkers\" using C programming language and GTK graphical user interface.",
    "image": "/placeholder.svg?height=200&width=300",
    "category": "Desktop Game",
    "timeline": {
      "start": "Mar 2023",
      "end": "May 2023"
    },
    "features": [
      "Classic Checkers gameplay with a rich graphical user interface.",
      "Single-player mode against AI for challenging gameplay.",
      "Two-player mode for competitive fun.",
      "AI with varying difficulty levels to suit all players.",
      "AI vs AI mode for automated gameplay."
    ],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      },
      {
        "name": "Yasser TRIDOU",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/tridou-yasser/",
        "github": "https://www.github.com/yasser-TRIDOU"
      }
    ],
    "technologies": ["C Programming", "GTK+"],
    "tags": ["C", "GTK+", "Algorithms", "Data Structures"]
  },
  {
    "title": "Tic-Tac-Toe Game",
    "slug": "tic-tac-toe-game",
    "excerpt": "Tic-Tac-Toe game developed with HTML, CSS, and JavaScript for two-player fun and vs. AI.",
    "overview": "Developed a web-based Tic-Tac-Toe game using HTML, CSS, and JavaScript for two-player fun and vs. AI.",
    "image": "/projects/tic-tac-toe.png",
    "category": "Web Game",
    "timeline": {
      "start": "Sep 2023",
      "end": "Sep 2023"
    },
    "technologies": ["HTML", "CSS", "JavaScript"],
    "features": [
      "Classic Tic-Tac-Toe gameplay with a clean, intuitive interface.",
      "Single-player mode against AI for challenging gameplay.",
      "Two-player mode for competitive fun.",
      "AI with varying difficulty levels to suit all players.",
      "Save and load game functionality for resuming play at any time."
    ],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      }
    ],
    "tags": ["HTML", "CSS", "JavaScript"],
    "github": "https://github.com/ismailza/Tic-Tac-Toe",
    "demo": "https://ismailza.github.io/Tic-Tac-Toe/"
  },
  {
    "title": "Js To-Do List",
    "slug": "js-to-do-list",
    "excerpt": "Simple to-do list web app developed with HTML, CSS, and JavaScript for managing tasks.",
    "overview": "Developed a simple to-do list web application using HTML, CSS, and JavaScript to manage tasks.",
    "image": "/projects/js-todo-list.png",
    "category": "Web Application",
    "timeline": {
      "start": "Jul 2023",
      "end": "Jul 2023"
    },
    "features": [
      "Add, edit, and delete tasks for efficient task management.",
      "Mark tasks as complete to track progress.",
      "Responsive design for optimal viewing on desktop and mobile devices.",
      "Dark mode for reduced eye strain during night-time use."
    ],
    "technologies": ["HTML", "CSS", "JavaScript"],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      }
    ],
    "tags": ["HTML", "CSS", "JavaScript"],
    "github": "https://github.com/ismailza/Js-ToDo-List",
    "demo": "https://ismailza.github.io/Js-ToDo-List/"
  },
  {
    "title": "Js Simple Calculator",
    "slug": "js-simple-calculator",
    "excerpt": "Simple calculator web app developed with HTML, CSS, and JavaScript for basic arithmetic operations.",
    "overview": "Developed a simple calculator web application using HTML, CSS, and JavaScript to perform basic arithmetic operations.",
    "image": "/projects/js-calculator.png",
    "category": "Web Application",
    "timeline": {
      "start": "Jul 2023",
      "end": "Jul 2023"
    },
    "features": [
      "Basic arithmetic operations: addition, subtraction, multiplication, and division.",
      "Clear and delete functionality for correcting input errors.",
      "Responsive design for optimal viewing on desktop and mobile devices.",
      "Dark mode for reduced eye strain during night-time use."
    ],
    "technologies": ["HTML", "CSS", "JavaScript"],
    "tags": ["HTML", "CSS", "JavaScript"],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Mohammedia - UH2C",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      }
    ],
    "github": "https://github.com/ismailza/Simple-Js-Calculator",
    "demo": "https://ismailza.github.io/Simple-Js-Calculator/"
  },
  {
    "title": "Drâa Tafilalet Travel",
    "slug": "draa-tafilalet-travel",
    "excerpt": "Travel agency website developed with HTML, CSS, and JavaScript for showcasing tours and services.",
    "overview": "Developed a travel agency website using HTML, CSS, and JavaScript to showcase tours and services offered by the agency.",
    "image": "/projects/draa-tafilalet-travel.png",
    "category": "Web Application",
    "timeline": {
      "start": "May 2022",
      "end": "Jun 2022"
    },
    "features": [
      "Interactive map with tour locations and details.",
      "Hotel and tour packages with pricing and booking options.",
      "Restaurant and activity recommendations for travelers.",
      "Transportation services for easy travel arrangements.",
      "Contact form for inquiries and bookings.",
      "Responsive design for optimal viewing on desktop and mobile devices."
    ],
    "technologies": ["HTML", "CSS", "JavaScript", "Bootstrap", "JQuery", "Google Maps API", "AJAX"],
    "team": [
      {
        "name": "Ismail ZAHIR",
        "role": "Software Engineering Student at FST Errachidia - UMI",
        "linkedin": "https://www.linkedin.com/in/ismailzahir01/",
        "github": "https://www.github.com/ismailza"
      },
      {
        "name": "Ayoub ZITANE",
        "role": "Software Engineering Student at FST Errachidia - UMI",
        "linkedin": "https://www.linkedin.com/in/ayoub-zitane-a86a9429b"
      },
      {
        "name": "Zakia RHIOUI",
        "role": "Software Engineering Student at FST Errachidia - UMI",
        "linkedin": "https://www.linkedin.com/in/zakia-rhioui-8b9280246"
      }
    ],
    "featured": true,
    "tags": ["HTML", "CSS", "JavaScript", "Bootstrap"],
    "github": "https://github.com/ismailza/Draa-Tafilalet-Travel"
  }
]